-- phpMyAdmin SQL Dump
-- version 4.5.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Sep 28, 2016 at 03:35 PM
-- Server version: 5.7.11
-- PHP Version: 5.6.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stock`
--

-- --------------------------------------------------------

--
-- Table structure for table `params`
--
DROP TABLE IF EXISTS `params`;
CREATE TABLE `params` (
  `id` int(11) NOT NULL,
  `title` varchar(256) CHARACTER SET utf8 NOT NULL,
  `type` int(3) NOT NULL COMMENT '1-balance sheet; 2-income statement;3-statement of cash flow',
  `parent_id` int(11) NOT NULL,
  `level` int(11) NOT NULL,
  `created_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `del` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COMMENT='name of all data type';

--
-- Dumping data for table `params`
--

INSERT INTO `params` (`id`, `title`, `type`, `parent_id`, `level`, `created_date`, `updated_date`, `del`) VALUES
(1, 'TÀI SẢN', 1, 0, 1, '2016-09-28 13:33:56', '2016-09-28 13:33:56', 0),
(2, 'NGUỒN VỐN', 1, 0, 1, '2016-09-28 13:35:02', '2016-09-28 13:35:02', 0),
(3, 'A. Tài sản lưu động và đầu tư ngắn hạn', 1, 1, 2, '2016-09-28 13:35:21', '2016-09-28 13:35:21', 0),
(4, 'B. Tài sản cố định và đầu tư dài hạn', 1, 1, 2, '2016-09-28 13:35:52', '2016-09-28 13:35:52', 0),
(5, 'I. Tiền và các khoản tương đương tiền', 1, 3, 3, '2016-09-28 13:36:11', '2016-09-28 13:36:11', 0),
(6, 'II. Các khoản đầu tư tài chính ngắn hạn', 1, 3, 3, '2016-09-28 13:37:08', '2016-09-28 13:37:08', 0),
(7, 'III. Các khoản phải thu ngắn hạn', 1, 3, 3, '2016-09-28 13:38:02', '2016-09-28 13:38:02', 0),
(8, 'IV. Tổng hàng tồn kho', 1, 3, 3, '2016-09-28 13:39:13', '2016-09-28 13:39:13', 0),
(9, 'V. Tài sản ngắn hạn khác', 1, 3, 3, '2016-09-28 13:44:06', '2016-09-28 13:44:06', 0),
(10, 'V. Tài sản ngắn hạn khác', 1, 3, 3, '2016-09-28 13:44:09', '2016-09-28 13:57:00', 1),
(11, '1. Tiền', 1, 5, 4, '2016-09-28 13:57:58', '2016-09-28 13:57:58', 0),
(12, '2. Các khoản tương đương tiền', 1, 5, 4, '2016-09-28 13:58:14', '2016-09-28 13:58:14', 0),
(13, '1. Chứng khoán kinh doanh', 1, 6, 4, '2016-09-28 13:58:27', '2016-09-28 13:58:27', 0),
(14, '2. Dự phòng giảm giá chứng khoán kinh doanh', 1, 6, 4, '2016-09-28 13:58:35', '2016-09-28 13:58:35', 0),
(15, '3. Đầu tư nắm giữ đến ngày đáo hạn', 1, 6, 4, '2016-09-28 13:58:44', '2016-09-28 13:58:44', 0),
(16, '1. Phải thu ngắn hạn của khách hàng', 1, 7, 4, '2016-09-28 13:58:52', '2016-09-28 13:58:52', 0),
(17, '2. Trả trước cho người bán', 1, 7, 4, '2016-09-28 13:58:59', '2016-09-28 13:58:59', 0),
(18, '3. Phải thu nội bộ ngắn hạn', 1, 7, 4, '2016-09-28 13:59:06', '2016-09-28 13:59:06', 0),
(19, '4. Phải thu theo tiến độ hợp đồng xây dựng', 1, 7, 4, '2016-09-28 13:59:51', '2016-09-28 13:59:51', 0),
(20, '5. Phải thu về cho vay ngắn hạn', 1, 7, 4, '2016-09-28 13:59:59', '2016-09-28 13:59:59', 0),
(21, '6. Phải thu ngắn hạn khác', 1, 7, 4, '2016-09-28 14:00:05', '2016-09-28 14:00:05', 0),
(22, '7. Dự phòng phải thu ngắn hạn khó đòi', 1, 7, 4, '2016-09-28 14:00:12', '2016-09-28 14:00:12', 0),
(23, '1. Hàng tồn kho', 1, 8, 4, '2016-09-28 14:00:22', '2016-09-28 14:00:22', 0),
(24, '2. Dự phòng giảm giá hàng tồn kho', 1, 8, 4, '2016-09-28 14:00:29', '2016-09-28 14:00:29', 0),
(25, '1. Chi phí trả trước ngắn hạn', 1, 9, 4, '2016-09-28 14:00:36', '2016-09-28 14:06:06', 0),
(26, '2. Thuế giá trị gia tăng được khấu trừ', 1, 9, 4, '2016-09-28 14:06:12', '2016-09-28 14:06:12', 0),
(27, '3. Thuế và các khoản phải thu Nhà nước', 1, 9, 4, '2016-09-28 14:06:18', '2016-09-28 14:06:18', 0),
(28, '4. Giao dịch mua bán lại trái phiếu chính phủ', 1, 9, 4, '2016-09-28 14:06:27', '2016-09-28 14:06:27', 0),
(29, '5. Tài sản ngắn hạn khác', 1, 9, 4, '2016-09-28 14:06:34', '2016-09-28 14:06:34', 0),
(30, 'I. Các khoản phải thu dài hạn', 1, 4, 3, '2016-09-28 14:06:46', '2016-09-28 14:06:46', 0),
(31, '1. Phải thu dài hạn của khách hàng', 1, 30, 4, '2016-09-28 14:06:55', '2016-09-28 14:06:55', 0),
(32, '2. Vốn kinh doanh tại các đơn vị trực thuộc', 1, 30, 4, '2016-09-28 14:07:02', '2016-09-28 14:07:02', 0),
(33, '3. Phải thu dài hạn nội bộ', 1, 30, 4, '2016-09-28 14:07:08', '2016-09-28 14:07:08', 0),
(34, '4. Phải thu về cho vay dài hạn', 1, 30, 4, '2016-09-28 14:07:12', '2016-09-28 14:07:12', 0),
(35, '5. Phải thu dài hạn khác', 1, 30, 4, '2016-09-28 14:07:23', '2016-09-28 14:07:23', 0),
(36, '6. Dự phòng phải thu dài hạn khó đòi', 1, 30, 4, '2016-09-28 14:07:29', '2016-09-28 14:07:29', 0),
(37, 'II. Tài sản cố định', 1, 4, 3, '2016-09-28 14:07:48', '2016-09-28 14:07:48', 0),
(38, '1. Tài sản cố định hữu hình', 1, 37, 4, '2016-09-28 14:08:10', '2016-09-28 14:08:10', 0),
(39, '- Nguyên giá', 1, 38, 5, '2016-09-28 14:13:30', '2016-09-28 14:13:30', 0),
(40, '- Giá trị hao mòn lũy kế', 1, 38, 5, '2016-09-28 14:57:21', '2016-09-28 14:57:21', 0),
(41, 'Tài sản cố định thuê tài chính', 1, 37, 4, '2016-09-28 14:58:21', '2016-09-28 14:58:21', 0),
(42, '- Nguyên giá', 1, 41, 5, '2016-09-28 14:58:30', '2016-09-28 14:58:30', 0),
(43, '- Giá trị hao mòn lũy kế', 1, 41, 5, '2016-09-28 14:58:36', '2016-09-28 14:58:36', 0),
(44, 'III. Bất động sản đầu tư', 1, 4, 3, '2016-09-28 14:58:54', '2016-09-28 14:58:54', 0),
(45, '- Nguyên giá', 1, 44, 4, '2016-09-28 14:59:03', '2016-09-28 14:59:03', 0),
(46, '- Giá trị hao mòn lũy kế', 1, 44, 4, '2016-09-28 14:59:11', '2016-09-28 14:59:11', 0),
(47, 'IV. Tài sản dở dang dài hạn', 1, 4, 3, '2016-09-28 14:59:33', '2016-09-28 14:59:33', 0),
(48, '1. Chi phí sản xuất, kinh doanh dở dang dài hạn', 1, 47, 4, '2016-09-28 14:59:47', '2016-09-28 14:59:47', 0),
(49, '2. Chi phí xây dựng cơ bản dở dang', 1, 47, 4, '2016-09-28 14:59:56', '2016-09-28 15:00:13', 0),
(50, 'V. Các khoản đầu tư tài chính dài hạn', 1, 4, 3, '2016-09-28 15:00:35', '2016-09-28 15:00:35', 0),
(51, '1. Đầu tư vào công ty con', 1, 50, 4, '2016-09-28 15:00:47', '2016-09-28 15:00:47', 0),
(52, '2. Đầu tư vào công ty liên kết, liên doanh', 1, 50, 4, '2016-09-28 15:00:54', '2016-09-28 15:00:54', 0),
(53, '3. Đầu tư khác vào công cụ vốn', 1, 50, 4, '2016-09-28 15:01:00', '2016-09-28 15:01:00', 0),
(54, '4. Dự phòng giảm giá đầu tư tài chính dài hạn', 1, 50, 4, '2016-09-28 15:01:08', '2016-09-28 15:01:08', 0),
(55, '5. Đầu tư nắm giữ đến ngày đáo hạn', 1, 50, 4, '2016-09-28 15:01:15', '2016-09-28 15:01:15', 0),
(56, 'VI. Tổng tài sản dài hạn khác', 1, 4, 3, '2016-09-28 15:01:30', '2016-09-28 15:01:30', 0),
(57, '1. Chi phí trả trước dài hạn', 1, 56, 4, '2016-09-28 15:01:41', '2016-09-28 15:01:41', 0),
(58, '2. Tài sản Thuế thu nhập hoãn lại', 1, 56, 4, '2016-09-28 15:01:48', '2016-09-28 15:01:48', 0),
(59, '3. Tài sản dài hạn khác', 1, 56, 4, '2016-09-28 15:01:53', '2016-09-28 15:01:53', 0),
(60, 'VII. Lợi thế thương mại', 1, 4, 3, '2016-09-28 15:02:03', '2016-09-28 15:02:03', 0),
(61, 'A. Nợ phải trả', 1, 2, 2, '2016-09-28 15:02:20', '2016-09-28 15:02:20', 0),
(62, 'I. Nợ ngắn hạn', 1, 61, 3, '2016-09-28 15:02:30', '2016-09-28 15:02:30', 0),
(63, '1. Vay và nợ thuê tài chính ngắn hạn', 1, 62, 4, '2016-09-28 15:02:40', '2016-09-28 15:02:40', 0),
(64, '2. Vay và nợ dài hạn đến hạn phải trả', 1, 62, 4, '2016-09-28 15:02:45', '2016-09-28 15:02:45', 0),
(65, '3. Phải trả người bán ngắn hạn', 1, 62, 4, '2016-09-28 15:02:50', '2016-09-28 15:02:50', 0),
(66, '4. Người mua trả tiền trước', 1, 62, 4, '2016-09-28 15:02:56', '2016-09-28 15:02:56', 0),
(67, '5. Thuế và các khoản phải nộp nhà nước', 1, 62, 4, '2016-09-28 15:03:02', '2016-09-28 15:03:02', 0),
(68, '6. Phải trả người lao động', 1, 62, 4, '2016-09-28 15:03:09', '2016-09-28 15:03:09', 0),
(69, '7. Chi phí phải trả ngắn hạn', 1, 62, 4, '2016-09-28 15:03:14', '2016-09-28 15:03:14', 0),
(70, '8. Phải trả nội bộ ngắn hạn', 1, 62, 4, '2016-09-28 15:03:20', '2016-09-28 15:03:20', 0),
(71, '9. Phải trả theo tiến độ kế hoạch hợp đồng xây dựng', 1, 62, 4, '2016-09-28 15:03:27', '2016-09-28 15:03:27', 0),
(72, '10. Doanh thu chưa thực hiện ngắn hạn', 1, 62, 4, '2016-09-28 15:03:32', '2016-09-28 15:03:32', 0),
(73, '11. Phải trả ngắn hạn khác', 1, 62, 4, '2016-09-28 15:03:38', '2016-09-28 15:03:38', 0),
(74, '12. Dự phòng phải trả ngắn hạn', 1, 62, 4, '2016-09-28 15:03:43', '2016-09-28 15:03:43', 0),
(75, '13. Quỹ khen thưởng phúc lợi', 1, 62, 4, '2016-09-28 15:03:48', '2016-09-28 15:03:48', 0),
(76, '14. Quỹ bình ổn giá', 1, 62, 4, '2016-09-28 15:03:54', '2016-09-28 15:03:54', 0),
(77, '15. Giao dịch mua bán lại trái phiếu chính phủ', 1, 62, 4, '2016-09-28 15:03:59', '2016-09-28 15:03:59', 0),
(78, 'II. Nợ dài hạn', 1, 61, 3, '2016-09-28 15:04:23', '2016-09-28 15:04:23', 0),
(79, '1. Phải trả người bán dài hạn', 1, 78, 4, '2016-09-28 15:04:32', '2016-09-28 15:04:32', 0),
(80, '2. Chi phí phải trả dài hạn', 1, 78, 4, '2016-09-28 15:04:37', '2016-09-28 15:04:37', 0),
(81, '3. Phải trả nội bộ về vốn kinh doanh', 1, 78, 4, '2016-09-28 15:04:43', '2016-09-28 15:04:43', 0),
(82, '4. Phải trả nội bộ dài hạn', 1, 78, 4, '2016-09-28 15:04:50', '2016-09-28 15:04:50', 0),
(83, '5. Phải trả dài hạn khác', 1, 78, 4, '2016-09-28 15:04:55', '2016-09-28 15:04:55', 0),
(84, '6. Vay và nợ thuê tài chính dài hạn', 1, 78, 4, '2016-09-28 15:05:01', '2016-09-28 15:05:01', 0),
(85, '7. Trái phiếu chuyển đổi', 1, 78, 4, '2016-09-28 15:05:06', '2016-09-28 15:05:06', 0),
(86, '8. Thuế thu nhập hoãn lại phải trả', 1, 78, 4, '2016-09-28 15:05:12', '2016-09-28 15:05:12', 0),
(87, '9. Dự phòng trợ cấp mất việc làm', 1, 78, 4, '2016-09-28 15:05:17', '2016-09-28 15:05:17', 0),
(88, '10. Dự phòng phải trả dài hạn', 1, 78, 4, '2016-09-28 15:05:22', '2016-09-28 15:05:22', 0),
(89, '11. Doanh thu chưa thực hiện dài hạn', 1, 78, 4, '2016-09-28 15:05:28', '2016-09-28 15:05:28', 0),
(90, '12. Quỹ phát triển khoa học và công nghệ', 1, 78, 4, '2016-09-28 15:05:33', '2016-09-28 15:05:33', 0),
(91, 'B. Nguồn vốn chủ sở hữu', 1, 2, 2, '2016-09-28 15:05:51', '2016-09-28 15:05:51', 0),
(92, 'I. Vốn chủ sở hữu', 1, 91, 3, '2016-09-28 15:05:59', '2016-09-28 15:05:59', 0),
(93, '1. Vốn đầu tư của chủ sở hữu', 1, 92, 4, '2016-09-28 15:06:06', '2016-09-28 15:06:06', 0),
(94, 'II. Nguồn kinh phí và quỹ khác', 1, 91, 3, '2016-09-28 15:06:12', '2016-09-28 15:06:30', 0),
(95, '2. Thặng dư vốn cổ phần', 1, 92, 4, '2016-09-28 15:06:37', '2016-09-28 15:06:37', 0),
(96, '3. Quyền chọn chuyển đổi trái phiếu', 1, 92, 4, '2016-09-28 15:06:43', '2016-09-28 15:06:43', 0),
(97, '4. Vốn khác của chủ sở hữu', 1, 92, 4, '2016-09-28 15:06:51', '2016-09-28 15:06:51', 0),
(98, '5. Cổ phiếu quỹ', 1, 92, 4, '2016-09-28 15:06:59', '2016-09-28 15:06:59', 0),
(99, '6. Chênh lệch đánh giá lại tài sản', 1, 92, 4, '2016-09-28 15:07:06', '2016-09-28 15:07:06', 0),
(100, '7. Chênh lệch tỷ giá hối đoái', 1, 92, 4, '2016-09-28 15:07:11', '2016-09-28 15:07:22', 0),
(101, '8. Quỹ đầu tư phát triển', 1, 92, 4, '2016-09-28 15:07:28', '2016-09-28 15:07:28', 0),
(102, '9. Quỹ dự phòng tài chính', 1, 92, 4, '2016-09-28 15:07:33', '2016-09-28 15:07:33', 0),
(103, '10. Quỹ khác thuộc vốn chủ sở hữu', 1, 92, 4, '2016-09-28 15:07:40', '2016-09-28 15:07:40', 0),
(104, '11. Lợi nhuận sau thuế chưa phân phối', 1, 92, 4, '2016-09-28 15:07:48', '2016-09-28 15:07:48', 0),
(105, '- LNST chưa phân phối lũy kế đến cuối kỳ trước', 1, 104, 5, '2016-09-28 15:08:01', '2016-09-28 15:08:01', 0),
(106, '- LNST chưa phân phối kỳ này', 1, 104, 5, '2016-09-28 15:08:11', '2016-09-28 15:08:11', 0),
(107, '12. Nguồn vốn đầu tư xây dựng cơ bản', 1, 92, 4, '2016-09-28 15:08:27', '2016-09-28 15:08:27', 0),
(108, '13. Quỹ hỗ trợ sắp xếp doanh nghiệp', 1, 92, 4, '2016-09-28 15:08:33', '2016-09-28 15:08:33', 0),
(109, '14. Lợi ích của cổ đông không kiểm soát', 1, 92, 4, '2016-09-28 15:08:40', '2016-09-28 15:08:40', 0),
(110, '1. Nguồn kinh phí', 1, 94, 4, '2016-09-28 15:08:48', '2016-09-28 15:08:48', 0),
(111, '2. Nguồn kinh phí đã hình thành tài sản cố định', 1, 94, 4, '2016-09-28 15:08:56', '2016-09-28 15:08:56', 0),
(112, '3. Quỹ dự phòng trợ cấp mất việc làm', 1, 94, 4, '2016-09-28 15:09:01', '2016-09-28 15:09:01', 0),
(113, '1. Tổng doanh thu hoạt động kinh doanh', 2, 0, 1, '2016-09-28 15:19:48', '2016-09-28 15:19:48', 0),
(114, '2. Các khoản giảm trừ doanh thu', 2, 0, 1, '2016-09-28 15:19:55', '2016-09-28 15:19:55', 0),
(115, '3. Doanh thu thuần (1)-(2)', 2, 0, 1, '2016-09-28 15:20:43', '2016-09-28 15:20:43', 0),
(116, '4. Giá vốn hàng bán', 2, 0, 1, '2016-09-28 15:20:48', '2016-09-28 15:20:48', 0),
(117, '5. Lợi nhuận gộp (3)-(4)', 2, 0, 1, '2016-09-28 15:20:56', '2016-09-28 15:20:56', 0),
(118, '6. Doanh thu hoạt động tài chính', 2, 0, 1, '2016-09-28 15:21:04', '2016-09-28 15:21:04', 0),
(119, '7. Chi phí tài chính', 2, 0, 1, '2016-09-28 15:21:09', '2016-09-28 15:21:09', 0),
(120, '-Trong đó: Chi phí lãi vay', 2, 119, 2, '2016-09-28 15:21:15', '2016-09-28 15:21:15', 0),
(121, '8. Phần lợi nhuận hoặc lỗ trong công ty liên kết liên doanh', 2, 0, 1, '2016-09-28 15:21:22', '2016-09-28 15:21:22', 0),
(122, '9. Chi phí bán hàng', 2, 0, 1, '2016-09-28 15:21:32', '2016-09-28 15:21:32', 0),
(123, '10. Chi phí quản lý doanh nghiệp', 2, 0, 1, '2016-09-28 15:21:41', '2016-09-28 15:21:41', 0),
(124, '11. Lợi nhuận thuần từ hoạt động kinh doanh (5)+(6)-(7)+(8)-(9)-(10)', 2, 0, 1, '2016-09-28 15:22:17', '2016-09-28 15:22:17', 0),
(125, '12. Thu nhập khác', 2, 0, 1, '2016-09-28 15:22:23', '2016-09-28 15:22:23', 0),
(126, '13. Chi phí khác', 2, 0, 1, '2016-09-28 15:22:31', '2016-09-28 15:22:31', 0),
(127, '14. Lợi nhuận khác (12)-(13)', 2, 0, 1, '2016-09-28 15:22:36', '2016-09-28 15:22:36', 0),
(128, '15. Tổng lợi nhuận kế toán trước thuế (11)+(14)', 2, 0, 1, '2016-09-28 15:25:00', '2016-09-28 15:25:00', 0),
(129, '16. Chi phí thuế TNDN hiện hành', 2, 0, 1, '2016-09-28 15:25:14', '2016-09-28 15:25:14', 0),
(130, '17. Chi phí thuế TNDN hoãn lại', 2, 0, 1, '2016-09-28 15:25:19', '2016-09-28 15:25:19', 0),
(131, '18. Chi phí thuế TNDN (16)+(17)', 2, 0, 1, '2016-09-28 15:25:28', '2016-09-28 15:25:28', 0),
(132, '19. Lợi nhuận sau thuế thu nhập doanh nghiệp (15)-(18)', 2, 0, 1, '2016-09-28 15:25:35', '2016-09-28 15:25:35', 0),
(133, '20. Lợi nhuận sau thuế của cổ đông không kiểm soát', 2, 0, 1, '2016-09-28 15:25:40', '2016-09-28 15:25:40', 0),
(134, '21. Lợi nhuận sau thuế của cổ đông của công ty mẹ (19)-(20)', 2, 0, 1, '2016-09-28 15:25:47', '2016-09-28 15:25:47', 0),
(135, 'I. Lưu chuyển tiền từ hoạt động kinh doanh', 3, 0, 1, '2016-09-28 15:26:56', '2016-09-28 15:26:56', 0),
(136, '1. Lợi nhuận trước thuế', 3, 135, 2, '2016-09-28 15:27:03', '2016-09-28 15:27:03', 0),
(137, '2. Điều chỉnh cho các khoản', 3, 135, 2, '2016-09-28 15:27:10', '2016-09-28 15:27:10', 0),
(138, '- Khấu hao TSCĐ', 3, 137, 3, '2016-09-28 15:27:17', '2016-09-28 15:27:17', 0),
(139, '- Các khoản dự phòng', 3, 137, 3, '2016-09-28 15:27:22', '2016-09-28 15:27:22', 0),
(140, '- Lợi nhuận thuần từ đầu tư vào công ty liên kết', 3, 137, 3, '2016-09-28 15:27:27', '2016-09-28 15:27:27', 0),
(141, '- Xóa sổ tài sản cố định (thuần)', 3, 137, 3, '2016-09-28 15:27:32', '2016-09-28 15:27:32', 0),
(142, '- Lãi, lỗ chênh lệch tỷ giá hối đoái chưa thực hiện', 3, 137, 3, '2016-09-28 15:27:39', '2016-09-28 15:27:39', 0),
(143, '- Lãi, lỗ từ thanh lý TSCĐ', 3, 137, 3, '2016-09-28 15:27:44', '2016-09-28 15:27:44', 0),
(144, '- Lãi, lỗ từ hoạt động đầu tư', 3, 137, 3, '2016-09-28 15:27:52', '2016-09-28 15:28:00', 0),
(145, '- Lãi tiền gửi', 3, 137, 3, '2016-09-28 15:28:08', '2016-09-28 15:28:08', 0),
(146, '- Thu nhập lãi', 3, 137, 3, '2016-09-28 15:28:13', '2016-09-28 15:28:13', 0),
(147, '- Chi phí lãi vay', 3, 137, 3, '2016-09-28 15:28:18', '2016-09-28 15:28:18', 0),
(148, '- Các khoản chi trực tiếp từ lợi nhuận', 3, 137, 3, '2016-09-28 15:28:24', '2016-09-28 15:28:24', 0),
(149, '3. Lợi nhuận từ hoạt động kinh doanh trước thay đổi vốn lưu động', 3, 135, 2, '2016-09-28 15:28:44', '2016-09-28 15:28:44', 0),
(150, '- Tăng, giảm các khoản phải thu', 3, 149, 3, '2016-09-28 15:28:56', '2016-09-28 15:28:56', 0),
(151, '- Tăng, giảm hàng tồn kho', 3, 149, 3, '2016-09-28 15:29:02', '2016-09-28 15:29:02', 0),
(152, '- Tăng, giảm các khoản phải trả (Không kể lãi vay phải trả, thuế thu nhập doanh nghiệp phải nộp)', 3, 149, 3, '2016-09-28 15:29:08', '2016-09-28 15:29:08', 0),
(153, '- Tăng giảm chi phí trả trước', 3, 149, 3, '2016-09-28 15:29:15', '2016-09-28 15:29:15', 0),
(154, '- Tăng giảm tài sản ngắn hạn khác', 3, 149, 3, '2016-09-28 15:29:21', '2016-09-28 15:29:21', 0),
(155, '- Tiền lãi vay phải trả', 3, 149, 3, '2016-09-28 15:29:28', '2016-09-28 15:29:28', 0),
(156, '- Thuế thu nhập doanh nghiệp đã nộp', 3, 149, 3, '2016-09-28 15:29:33', '2016-09-28 15:29:33', 0),
(157, '- Tiền thu khác từ hoạt động kinh doanh', 3, 149, 3, '2016-09-28 15:29:40', '2016-09-28 15:29:40', 0),
(158, '- Tiền chi khác từ hoạt động kinh doanh', 3, 149, 3, '2016-09-28 15:29:47', '2016-09-28 15:29:47', 0),
(159, 'II. Lưu chuyển tiền từ hoạt động đầu tư', 3, 0, 1, '2016-09-28 15:30:02', '2016-09-28 15:30:02', 0),
(160, '1. Tiền chi để mua sắm, xây dựng TSCĐ và các tài sản dài hạn khác', 3, 159, 2, '2016-09-28 15:30:19', '2016-09-28 15:30:19', 0),
(161, '2. Tiền thu từ thanh lý, nhượng bán TSCĐ và các tài sản dài hạn khác', 3, 160, 3, '2016-09-28 15:30:26', '2016-09-28 15:30:35', 1),
(162, '2. Tiền thu từ thanh lý, nhượng bán TSCĐ và các tài sản dài hạn khác', 3, 159, 2, '2016-09-28 15:30:42', '2016-09-28 15:30:42', 0),
(163, '3. Tiền chi cho vay, mua các công cụ nợ của đơn vị khác', 3, 159, 2, '2016-09-28 15:30:47', '2016-09-28 15:30:47', 0),
(164, '4. Tiền thu hồi cho vay, bán lại các công cụ nợ của các đơn vị khác', 3, 159, 2, '2016-09-28 15:30:53', '2016-09-28 15:30:53', 0),
(165, '5. Đầu tư góp vốn vào công ty liên doanh liên kết', 3, 159, 2, '2016-09-28 15:30:59', '2016-09-28 15:30:59', 0),
(166, '6. Chi đầu tư ngắn hạn', 3, 159, 2, '2016-09-28 15:31:04', '2016-09-28 15:31:04', 0),
(167, '7. Tiền chi đầu tư góp vốn vào đơn vị khác', 3, 159, 2, '2016-09-28 15:31:13', '2016-09-28 15:31:13', 0),
(168, '8. Tiền thu hồi đầu tư góp vốn vào đơn vị khác', 3, 159, 2, '2016-09-28 15:31:22', '2016-09-28 15:31:22', 0),
(169, '9. Lãi tiền gửi đã thu', 3, 159, 2, '2016-09-28 15:31:27', '2016-09-28 15:31:27', 0),
(170, '10. Tiền thu lãi cho vay, cổ tức và lợi nhuận được chia', 3, 159, 2, '2016-09-28 15:31:33', '2016-09-28 15:31:33', 0),
(171, '11. Tiền chi mua lại phần vốn góp của các cổ đông thiểu số', 3, 159, 2, '2016-09-28 15:31:40', '2016-09-28 15:31:40', 0),
(172, 'III. Lưu chuyển tiền từ hoạt động tài chính', 3, 0, 1, '2016-09-28 15:31:54', '2016-09-28 15:31:54', 0),
(173, '1. Tiền thu từ phát hành cổ phiếu, nhận vốn góp của chủ sở hữu', 3, 172, 2, '2016-09-28 15:32:03', '2016-09-28 15:32:03', 0),
(174, '2. Tiền chi trả vốn góp cho các chủ sở hữu, mua lại cổ phiếu của doanh nghiệp đã phát hành', 3, 172, 2, '2016-09-28 15:32:09', '2016-09-28 15:32:09', 0),
(175, '3. Tiền vay ngắn hạn, dài hạn nhận được', 3, 172, 2, '2016-09-28 15:32:15', '2016-09-28 15:32:15', 0),
(176, '4. Tiền chi trả nợ gốc vay', 3, 172, 2, '2016-09-28 15:32:21', '2016-09-28 15:32:21', 0),
(177, '5. Tiền chi trả nợ thuê tài chính', 3, 172, 2, '2016-09-28 15:32:25', '2016-09-28 15:32:25', 0),
(178, '6. Tiền chi khác từ hoạt động tài chính', 3, 172, 2, '2016-09-28 15:32:30', '2016-09-28 15:32:30', 0),
(179, '7. Tiền chi trả từ cổ phần hóa', 3, 172, 2, '2016-09-28 15:32:34', '2016-09-28 15:32:34', 0),
(180, '8. Cổ tức, lợi nhuận đã trả cho chủ sở hữu', 3, 172, 2, '2016-09-28 15:32:38', '2016-09-28 15:32:38', 0),
(181, '9. Vốn góp của các cổ đông thiểu số vào các công ty con', 3, 172, 2, '2016-09-28 15:32:45', '2016-09-28 15:32:45', 0),
(182, '10. Chi tiêu quỹ phúc lợi xã hội', 3, 172, 2, '2016-09-28 15:32:49', '2016-09-28 15:32:49', 0),
(183, 'Lưu chuyển tiền thuần từ hoạt động tài chính', 3, 172, 2, '2016-09-28 15:32:53', '2016-09-28 15:33:05', 1),
(184, 'Lưu chuyển tiền thuần trong kỳ', 3, 0, 1, '2016-09-28 15:33:14', '2016-09-28 15:33:14', 0),
(185, 'Tiền và tương đương tiền đầu kỳ', 3, 0, 1, '2016-09-28 15:33:23', '2016-09-28 15:33:23', 0),
(186, 'Ảnh hưởng của thay đổi tỷ giá hối đoái quy đổi ngoại tệ', 3, 0, 1, '2016-09-28 15:33:30', '2016-09-28 15:33:30', 0),
(187, 'Tiền và tương đương tiền cuối kỳ', 3, 0, 1, '2016-09-28 15:33:35', '2016-09-28 15:33:35', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `params`
--
ALTER TABLE `params`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `params`
--
ALTER TABLE `params`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=188;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
